In [ ]:
%load tutorial.db [rw]

In [ ]:
Create table If Not Exists Seat (id int, student varchar(255))

In [ ]:
insert into Seat (id, student) values ('1', 'Abbot')

In [ ]:
insert into Seat (id, student) values ('2', 'Doris')

In [ ]:
insert into Seat (id, student) values ('3', 'Emerson')

In [ ]:
insert into Seat (id, student) values ('4', 'Green')

In [ ]:
insert into Seat (id, student) values ('5', 'Jeames')

In [ ]:
select * from seat

+----+---------+
| id | student |
+----+---------+
| 1  | Abbot   |
+----+---------+
| 2  | Doris   |
+----+---------+
| 3  | Emerson |
+----+---------+
| 4  | Green   |
+----+---------+
| 5  | Jeames  |
+----+---------+

## Write a solution to swap the seat id of every two consecutive students. If the number of students is odd, the id of the last student is not swapped.

In [ ]:
select (case when id%2=0 then id-1 else id+1 end), student from seat

+--------------------------------------------+---------+
| (case when id%2=0 then id-1 else id+1 end) | student |
+--------------------------------------------+---------+
| 2                                          | Abbot   |
+--------------------------------------------+---------+
| 1                                          | Doris   |
+--------------------------------------------+---------+
| 4                                          | Emerson |
+--------------------------------------------+---------+
| 3                                          | Green   |
+--------------------------------------------+---------+
| 6                                          | Jeames  |
+--------------------------------------------+---------+

In [ ]:
select (case when id%2=0 then id-1 else id+1 end), student from seat where id<=4

+--------------------------------------------+---------+
| (case when id%2=0 then id-1 else id+1 end) | student |
+--------------------------------------------+---------+
| 2                                          | Abbot   |
+--------------------------------------------+---------+
| 1                                          | Doris   |
+--------------------------------------------+---------+
| 4                                          | Emerson |
+--------------------------------------------+---------+
| 3                                          | Green   |
+--------------------------------------------+---------+

In [ ]:
select (count(*)/2)*2 from seat

+----------------+
| (count(*)/2)*2 |
+----------------+
| 4              |
+----------------+

In [ ]:
select (case when id%2=0 then id-1 else id+1 end), student from seat where id<= (select (count(*)/2)*2 from seat)

+--------------------------------------------+---------+
| (case when id%2=0 then id-1 else id+1 end) | student |
+--------------------------------------------+---------+
| 2                                          | Abbot   |
+--------------------------------------------+---------+
| 1                                          | Doris   |
+--------------------------------------------+---------+
| 4                                          | Emerson |
+--------------------------------------------+---------+
| 3                                          | Green   |
+--------------------------------------------+---------+

In [ ]:
select * from seat where id> (select (count(*)/2)*2 from seat)

+----+---------+
| id | student |
+----+---------+
| 5  | Jeames  |
+----+---------+

In [ ]:
select (case when id%2=0 then id-1 else id+1 end), student from seat where id<= (select (count(*)/2)*2 from seat)
union
select * from seat where id> (select (count(*)/2)*2 from seat)

+--------------------------------------------+---------+
| (case when id%2=0 then id-1 else id+1 end) | student |
+--------------------------------------------+---------+
| 1                                          | Doris   |
+--------------------------------------------+---------+
| 2                                          | Abbot   |
+--------------------------------------------+---------+
| 3                                          | Green   |
+--------------------------------------------+---------+
| 4                                          | Emerson |
+--------------------------------------------+---------+
| 5                                          | Jeames  |
+--------------------------------------------+---------+